genderly = {
    'бесполый': 'fas fa-genderless',
    'мужской': 'fas fa-mars',
    'женский': 'fas fa-venus',
}

id_pokeballs = {
    'покебол': "//img[@src='/img/world/items/small/3.png']",
    'гритбол': "//img[@src='/img/world/items/small/4.png']",
    'мастербол': "//img[@src='/img/world/items/small/5.png']",
    'ультрабол': "//img[@src='/img/world/items/small/6.png']",
    'генобол': "//img[@src='/img/world/items/small/109.png']",
    'шайнибол': "//img[@src='/img/world/items/small/123.png']",
    'дистанцбол': "//img[@src='/img/world/items/small/316.png']",
    'сафарибол': "//img[@src='/img/world/items/small/318.png']",
    'взломанный шайнибол': "//img[@src='/img/world/items/small/392.png']",
}

priority = {
    '/img/world/items/small/109.png': 1,  # Geneball
    '/img/world/items/small/6.png': 2,  # Ultraball
    '/img/world/items/small/4.png': 3,  # Greatball
    '/img/world/items/small/3.png': 4,  # Pokeball
    '/img/world/items/small/5.png': 5,  # Masterball
    '/img/world/items/small/316.png': 6,  # Distanceball
    '/img/world/items/small/123.png': 7,  # Shineball
    '/img/world/items/small/392.png': 8,  # Hacked shineball
}

runners_list = [
    '#624 Поньярд',
    '#054 Псидак',
    '#127 Пинсир',
    '#672 Скиддо',
    '#451 Скорупи',
    '#819 Сквовет',
    '#718 Зигард',
    '#214 Геракросс',
    '#455 Карнивайн',
    '#325 Споинк',
    '#835 Ямпер',
    '#379 Реджистил',
    '#594 Аломомола',
    '#679 Хонэдж',
    '#243 Райкоу',
    '#492 Шеймин',  # Regular runners
    '#827 Никит',
    '#543 Венипид',
    '#353 Шаппет',
    '#079 Слоупок',
    '#285 Шрумиш',
    '#096 Дроузи',
    '#227 Скармори',
    '#780 Дрампа',
    '#570 Зоруа',
    '#669 Флабебе',
    '#488 Кресселия'
]

type_chart = {
    'Насекомое': {'Темный': 2, 'Боевой': 0.5, 'Огненный': 0.5, 'Летающий': 0.5, 'Призрак': 0.5, 'Травяной': 2,
                  'Ядовитый': 0.5, 'Психический': 2, 'Стальной': 0.5, 'Волшебный': 0.5},
    'Темный': {'Темный': 0.5, 'Боевой': 0.5, 'Призрак': 2, 'Психический': 2, 'Волшебный': 0.5},
    'Дракон': {'Дракон': 2, 'Стальной': 0.5, 'Волшебный': 0},
    'Электрический': {'Дракон': 0.5, 'Электрический': 0.5, 'Летающий': 2, 'Травяной': 0.5, 'Земляной': 0, 'Водный': 2},
    'Боевой': {'Насекомое': 0.5, 'Темный': 2, 'Летающий': 0.5, 'Призрак': 0, 'Ледяной': 2, 'Ядовитый': 0.5,
               'Психический': 0.5, 'Каменный': 2, 'Стальной': 2, 'Волшебный': 0.5, 'Нормальный': 2},
    'Огненный': {'Насекомое': 2, 'Дракон': 0.5, 'Огненный': 0.5, 'Травяной': 2, 'Ледяной': 2, 'Водный': 0.5,
                 'Каменный': 0.5, 'Стальной': 2},
    'Летающий': {'Насекомое': 2, 'Электрический': 0.5, 'Боевой': 2, 'Травяной': 2, 'Каменный': 0.5, 'Стальной': 0.5},
    'Призрак': {'Темный': 0.5, 'Призрак': 2, 'Психический': 2, 'Нормальный': 0},
    'Травяной': {'Насекомое': 0.5, 'Дракон': 0.5, 'Огненный': 0.5, 'Летающий': 0.5, 'Травяной': 0.5, 'Земляной': 2,
                 'Водный': 2, 'Ядовитый': 0.5, 'Каменный': 2, 'Стальной': 0.5},
    'Земляной': {'Насекомое': 0.5, 'Электрический': 2, 'Огненный': 2, 'Летающий': 0, 'Травяной': 0.5, 'Ядовитый': 2,
                 'Каменный': 2, 'Стальной': 2},
    'Ледяной': {'Дракон': 2, 'Огненный': 0.5, 'Летающий': 2, 'Травяной': 2, 'Земляной': 2, 'Ледяной': 0.5,
                'Водный': 0.5, 'Стальной': 0.5},
    'Водный': {'Дракон': 0.5, 'Огненный': 2, 'Травяной': 0.5, 'Земляной': 2, 'Водный': 0.5, 'Каменный': 2},
    'Ядовитый': {'Летающий': 0.5, 'Травяной': 2, 'Земляной': 0.5, 'Ядовитый': 0.5, 'Каменный': 0.5, 'Стальной': 0,
                 'Волшебный': 2},
    'Психический': {'Темный': 0, 'Боевой': 2, 'Ядовитый': 2, 'Психический': 0.5, 'Стальной': 0.5},
    'Каменный': {'Насекомое': 2, 'Боевой': 0.5, 'Огненный': 2, 'Летающий': 2, 'Земляной': 0.5, 'Ледяной': 2,
                 'Стальной': 0.5},
    'Стальной': {'Электрический': 0.5, 'Огненный': 0.5, 'Ледяной': 2, 'Водный': 0.5, 'Каменный': 2, 'Стальной': 0.5,
                 'Волшебный': 2},
    'Волшебный': {'Темный': 2, 'Дракон': 2, 'Боевой': 2, 'Огненный': 0.5, 'Ядовитый': 0.5, 'Стальной': 0.5},
    'Нормальный': {'Призрак': 0, 'Каменный': 0.5, 'Стальной': 0.5}
}

icon_type = {
    '/img/world/typs/bug.png': 'Насекомое',
    '/img/world/typs/dark.png': 'Темный',
    '/img/world/typs/dragon.png': 'Дракон',
    '/img/world/typs/electric.png': 'Электрический',
    '/img/world/typs/fighting.png': 'Боевой',
    '/img/world/typs/fire.png': 'Огненный',
    '/img/world/typs/fly.png': 'Летающий',
    '/img/world/typs/ghost.png': 'Призрак',
    '/img/world/typs/grass.png': 'Травяной',
    '/img/world/typs/ground.png': 'Земляной',
    '/img/world/typs/ice.png': 'Ледяной',
    '/img/world/typs/water.png': 'Водный',
    '/img/world/typs/poison.png': 'Ядовитый',
    '/img/world/typs/psychic.png': 'Психический',
    '/img/world/typs/rock.png': 'Каменный',
    '/img/world/typs/steel.png': 'Стальной',
    '/img/world/typs/fairy.png': 'Волшебный',
    '/img/world/typs/normal.png': 'Нормальный',
}
